Revit 2027 API
BuiltInFailures.DimensionFailures.LinearConstraintBadDirection Property
 Bad direction vector in dimension element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LinearConstraintBadDirection { get; }
Public Shared ReadOnly Property LinearConstraintBadDirection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LinearConstraintBadDirection {
	FailureDefinitionId^ get ();
}
static member LinearConstraintBadDirection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace